Repository: 09arnold/cloudstack
Catalog: docs/runbook/*/config.po
Languages: fr_fr

source: As we noted before we will be using security groups to provide isolation and by default that implies that we'll be using a flat layer-2 network. It also means that the simplicity of our setup means that we can use the quick installer.
fr_fr: Comme indiqué précédemment, la sécurité par groupes sera utilisée pour assurer l'isolation, et cela implique par défaut l'utilisation d'un réseau plat de niveau 2, c'est-à-dire non hiérarchique, où les machines peuvent communiquer entre elles sans passer par des intermédiaires autre que des switches.Cela signifie aussi que la simplicité de la configuration permet d'utiliser l'installeur rapide.

source: UI Access
fr_fr: Accès à l'interface utilisateur

source: To get access to CloudStack's web interface, merely point your browser to http://<replaceable>172.16.10.</replaceable>2:8080/client The default username is 'admin', and the default password is 'password'. You should see a splash screen that allows you to choose several options for setting up CloudStack. You should choose the <option>Continue with Basic Setup</option> option.
fr_fr: Pour accéder à l'interface web CloudStack, il suffit de visiter http://<replaceable>172.16.10.</replaceable>2:8080/client à l'aide d'un navigateur. L'utilisateur par défaut est 'admin' et le mot de passe par défaut est 'password'. Un écran d'accueil permet alors de choisir entre différentes options pour configurer CloudStack. Choisir l'option <option>Continue with Basic Setup</option>.

source: You should now see a prompt requiring you to change the password for the admin user. Please do so.
fr_fr: Un formulaire demande alors de changer le mot de passe pour l'administrateur. Il est recommandé de changer ce mot de passe.

source: Setting up a Zone
fr_fr: Conigurer une zone

source: A zone is the largest organization entity in CloudStack - and we'll be creating one, this should be the screen that you see in front of you now. And for us there are 5 pieces of information that we need.
fr_fr: Une zone est l'entité la plus large de CloudStack - et quand une zone sera créée, cet écran devra apparaitre. Il contient cinq informations essentielles.

source: Name - we will set this to the ever-descriptive 'Zone1' for our cloud.
fr_fr: Name - le nom sera initialisé à 'Zone1' pour ce cloud.

source: Public DNS 1 - we will set this to '8.8.8.8' for our cloud.
fr_fr: Public DNS 1 - initialiser à '8.8.8.8' pour ce cloud.

source: Public DNS 2 - we will set this to '8.8.4.4' for our cloud.
fr_fr: Public DNS 2 - initialiser à '8.8.4.4' pour ce cloud.

source: Internal DNS1 - we will also set this to '8.8.8.8' for our cloud.
fr_fr: Internal DNS1 - initialiser à '8.8.8.8' pour ce cloud.

source: Internal DNS2 - we will also set this to '8.8.8.4' for our cloud.
fr_fr: Internal DNS2 - initialiser à '8.8.8.4' pour ce cloud.

source: Notes about DNS settings
fr_fr: Notes à propos des paramètres DNS

source: CloudStack distinguishes between internal and public DNS. Internal DNS is assumed to be capable of resolving internal-only hostnames, such as your NFS server’s DNS name. Public DNS is provided to the guest VMs to resolve public IP addresses. You can enter the same DNS server for both types, but if you do so, you must make sure that both internal and public IP addresses can route to the DNS server. In our specific case we will not use any names for resources internally, and we have indeed them set to look to the same external resource so as to not add a namerserver setup to our list of requirements.
fr_fr: CloudStack fait la distinction entre les DNS public et interne. Le DNS interne est capable de résoudre seulement les noms de domaine internes, comme le nom DNS du serveur NFS. Le DNS public est fourni aux machines virtuelles invitées pour leur permettre de résoudre les adresses IP publiques. Il est possible d'utiliser le même serveur DNS pour les deux types, mais il faut alors être sûr que les adresses IP interne et publique puissent router vers le serveur DNS. Pour la suite, dans le cas présent, aucun nom ne sera donné aux ressources en interne, et elles seront définies afin de pointer vers la même ressource externe pour ne pas ajouter la configuration d'un serveur de noms dans la liste des prérequis.

source: Pod Configuration
fr_fr: Configuration du pod

source: Now that we've added a Zone, the next step that comes up is a prompt for information regading a pod. Which is looking for 4 items.
fr_fr: Maintenant que la zone est ajoutée, la prochaine fenêtre qui apparaît concerne la création d'un pod. Elle demande 4 éléments.

source: Name - We'll use Pod1 for our cloud.
fr_fr: Name - Le nom sera Pod1 pour ce cloud.

source: Gateway - We'll use <replaceable>172.16.10</replaceable>.1 as our gateway
fr_fr: Gateway - <replaceable>172.16.10</replaceable>.1 sera utilisé comme passerelle

source: Netmask - We'll use 255.255.255.0
fr_fr: Netmask - initialiser à 255.255.255.0

source: Start/end reserved system IPs - we will use 172.16.10.10-172.16.10.20
fr_fr: Start/end reserved system IPs - utiliser 172.16.10.10-172.16.10.20 comme plage d'addresses IP système réservées

source: Guest gateway - We'll use <replaceable>172.16.10</replaceable>.1
fr_fr: Guest gateway - utiliser <replaceable>172.16.10</replaceable>.1

source: Guest netmask - We'll use 255.255.255.0
fr_fr: Guest netmask - le masque sera 255.255.255.0

source: Guest start/end IP - We'll use <replaceable>172.16.10.</replaceable>30-<replaceable>172.16.10.</replaceable>200
fr_fr: Guest start/end IP - les IP seront <replaceable>172.16.10.</replaceable>30-<replaceable>172.16.10.</replaceable>200

source: Now that we've added a Zone, we need only add a few more items for configuring the cluster.
fr_fr: Maintenant que la zone est ajoutée, seules quelques informations supplémentaires sont nécessaires pour configurer le cluster.

source: Name - We'll use Cluster1
fr_fr: Name - le nom sera Cluster1

source: Hypervisor - Choose KVM
fr_fr: Hypervisor - Choisir KVM

source: You should be prompted to add the first host to your cluster at this point. Only a few bits of information are needed.
fr_fr: Le premier hôte du cluster peut alors être ajouté. Seuls quelques détails sont nécessaires.

source: Hostname - we'll use the IP address <replaceable>172.16.10.</replaceable>2 since we didn't set up a DNS server.
fr_fr: Hostname - l'adresse IP <replaceable>172.16.10.</replaceable>2 sera utilisée puisque le serveur DNS n'est pas configuré.

source: Username - we'll use 'root'
fr_fr: Hostname - l'adresse IP <replaceable>172.16.10.</replaceable>2 sera utilisée puisque le serveur DNS n'est pas configuré.

source: Password - enter the operating system password for the root user
fr_fr: Password - entrer le mot de passe du système d'exploitation correspondant à l'utilisateur root

source: Primary Storage
fr_fr: Premier stockage

source: With your cluster now setup - you should be prompted for primary storage information. Choose NFS as the storage type and then enter the following values in the fields:
fr_fr: Maintenant que votre cluster est configuré vous devriez rentrer les informations pour le système de stockage primaire. Choisissez NFS comme type de stockage et entrez les valeurs suivantes:

source: Name - We'll use 'Primary1'
fr_fr: Name - utiliser 'Primary1'

source: Server - We'll be using the IP address <replaceable>172.16.10.</replaceable>2
fr_fr: Server - utiliser l'adresse IP <replaceable>172.16.10.</replaceable>2

source: Path - Well define /primary as the path we are using
fr_fr: Path - définir /primary comme chemin utilisé

source: Secondary Storage
fr_fr: Stockage secondaire

source: If this is a new zone, you'll be prompted for secondary storage information - populate it as follows:
fr_fr: Si c'est une nouvelle zone, il sera demandé des informations complémentaires pour l'espace de stockage secondaire- les renseigner comme suit :

source: NFS server - We'll use the IP address <replaceable>172.16.10.</replaceable>2
fr_fr: NFS server - utiliser l'adresse IP <replaceable>172.16.10.</replaceable>2

source: Path - We'll use /secondary
fr_fr: Path - utiliser le répertoire /secondary

source: Now, click Launch and your cloud should begin setup - it may take several minutes depending on your internet connection speed for setup to finalize.
fr_fr: Maintenant, cliquer sur Launch et le cloud devrait commencer à se configurer - cela peut prendre plusieurs minutes selon la vitesse de la connexion internet lors de la finalisation de la configuration.
