Repository: 09arnold/cloudstack
Catalog: docs/qig/*/config.po
Languages: it_it, ja_jp, zh_tw

source: Configuration
it_it: Configurazione
ja_jp: 設定
zh_tw: 系統設定

source: As we noted before we will be using security groups to provide isolation and by default that implies that we'll be using a flat layer-2 network. It also means that the simplicity of our setup means that we can use the quick installer.
it_it: Come già indicato, saranno utilizzati i security group per fornire l'isolamento necessario in termini di sicurezza e questo implica che si farà uso di una rete flat layer-2. Questo implica inoltre che la semplicità del setup consente di utilizzare il quick installer.
ja_jp: 前に記述したように、デフォルトではセキュリティグループを使用して分離を提供します。これは、フラットなLayer-2ネットワークを使用するということを意味します。また、セットアップを単純化することで、クイックインストーラーを使用できるということも意味します。
zh_tw: 如上述，本手冊所描述的環境將使用security groups提供網路隔離的機制，因此您的安裝環境需要一個layer-2網路，這也意味著提供了較為簡易的設定和快速安裝

source: UI Access
it_it: Accesso UI
ja_jp: UIアクセス
zh_tw: 使用UI

source: To get access to CloudStack's web interface, merely point your browser to http://<replaceable>172.16.10.</replaceable>2:8080/client The default username is 'admin', and the default password is 'password'. You should see a splash screen that allows you to choose several options for setting up CloudStack. You should choose the <option>Continue with Basic Setup</option> option.
it_it: Per accedere all'interfaccia web CloudStack, puntare il browser all'indirizzo http://<replaceable>172.16.10.</replaceable>2:8080/client L'utente di default è 'admin', e la password di default è 'password'. Viene visualizzata una schermata che consente di scegliere varie opzioni per la configurazione di CloudStack. Selezionare l'opzione <option>Continue with Basic Setup</option> option.
ja_jp: CloudStackのWebインターフェースにアクセスするためには、単にブラウザにhttp://<replaceable>172.16.10.</replaceable>2:8080/clientを指定すればよいです。デフォルトのユーザー名は'admin'で、デフォルトのパスワードは'password'です。スプラッシュスクリーンでは、CloudStackのセットアップを行う、いくつかのオプションを選択することができます。ここでは、<option>基本インストールを実行する</option> オプションを選びます。
zh_tw: 訪問CloudStack的UI，僅需使用瀏覽器逕行訪問：http://<replaceable>172.16.10.</replaceable>2:8080/client預設的使用者帳號為"admin"，而預設密碼為"password"。第一次登入後可以看到歡迎畫面，且提供了兩個設定CloudStack的選項，請選擇"繼續執行基本安裝"

source: You should now see a prompt requiring you to change the password for the admin user. Please do so.
it_it: Viene visualizzato un prompt con richiesta di modifica della password per l'utente admin. Inserire i dati richiesti.
ja_jp: ここで管理者ユーザーのパスワードを変更するように要求するプロンプトが表示されますので、変更してください。
zh_tw: 此時您會被要求修改admin帳號的密碼，請更新後繼續下一個步驟

source: Setting up a Zone
it_it: Configurazione di una Zona
ja_jp: ゾーンのセットアップ
zh_tw: 設定zone

source: A zone is the largest organization entity in CloudStack - and we'll be creating one, this should be the screen that you see in front of you now. And for us there are 5 pieces of information that we need.
it_it: Una zona è l'entità di organizzazione più grande in un cloud CloudStack - e qui se ne creerà una, questa dovrebbe essere la schermata che compare ora. Ora occorre fornire 5 gruppi di informazioni.
ja_jp: ゾーンはCloudStackにおける最大の組織単位で、1つ作成していきます。現在この画面が表示されているはずです。5つの情報を入力する必要があります。
zh_tw: zone是CloudStack中最大的運行單位，下面將會繼續描述如何建立一個zone；此時螢幕顯示的是新增zone的頁面，這裡需要您提供以下資訊：

source: Name - we will set this to the ever-descriptive 'Zone1' for our cloud.
it_it: Name - viene qui definito il nome 'Zone1' per questo cloud.
ja_jp: 名前 - ここでは作成するクラウドに"Zone1”と設定します。
zh_tw: 名稱 - 提通描述性的名稱，這裡以"Zone1"為例

source: Public DNS 1 - we will set this to '8.8.8.8' for our cloud.
it_it: Public DNS 1 - viene qui definito '8.8.8.8' per questo cloud.
ja_jp: 外部DNS 1 - ここでは作成するクラウドに'8.8.8.8'と設定します。
zh_tw: DNS1 - 設定為8.8.8.8

source: Public DNS 2 - we will set this to '8.8.4.4' for our cloud.
it_it: Public DNS 2 - si definirà '8.8.4.4' per questo cloud.
ja_jp: 外部DNS 2 - ここでは作成するクラウドに’8.8.4.4'と設定します。
zh_tw: DNS2 - 設定為8.8.4.4

source: Internal DNS1 - we will also set this to '8.8.8.8' for our cloud.
it_it: Internal DNS1 - viene anche qui definito '8.8.8.8' per questo cloud.
ja_jp: 内部DNS 1 - ここでは作成するクラウドに'8.8.8.8'と設定します。
zh_tw: 內部DNS1 - 設定為8.8.8.8

source: Internal DNS2 - we will also set this to '8.8.8.4' for our cloud.
it_it: Internal DNS2 - viene anche qui definito 8.8.4.4 per il cloud.
ja_jp: 内部DNS 2 - ここでは作成するクラウドに'8.8.4.4'と設定します。
zh_tw: 內部DNS2 - 設定為8.8.4.4

source: Notes about DNS settings
it_it: Note per le impostazioni DNS
ja_jp: DNS設定の注意
zh_tw: 關於DNS設定

source: CloudStack distinguishes between internal and public DNS. Internal DNS is assumed to be capable of resolving internal-only hostnames, such as your NFS server’s DNS name. Public DNS is provided to the guest VMs to resolve public IP addresses. You can enter the same DNS server for both types, but if you do so, you must make sure that both internal and public IP addresses can route to the DNS server. In our specific case we will not use any names for resources internally, and we have indeed them set to look to the same external resource so as to not add a namerserver setup to our list of requirements.
it_it: CloudStack distingue tra DNS pubblici e interni. L'assunzione è che i DNS Internal possano risolvere solo gli hostname interni, come ad esempio il nome host del server DNS. I DNS Public sono forniti alle VM guest per risolvere indirizzi IP pubblici. Si possono inserire gli stessi server DNS per entrambi le aree, ma in questo caso è necessario che sia i sistemi con indirizzi IP interni che quelli con indirizzi IP pubblici devono poter raggiungere i server DNS. Nel caso specifico non si utilizzano nomi per le risorse interne, che sono state volutamente configurate per accedere alla stessa risorsa esterna consentendo di evitare la configurazione di server DNS interni.
ja_jp: CloudStackは内部と外部のDNSを区別しています。内部DNSは内部のみのホスト名、例えば、NFSサーバーのDNS名などを解決できることを想定しています。外部DNSはゲストVMがパブリックのIPアドレスを解決するために提供されます。両方のタイプに同じDNSサーバーを指定することも可能ですが、もしそうするなら、そのDNSサーバーは内部のIPもパブリックのIPも両方解決できる必要があります。この手順では、内部リソースには名前を使用せず、実際には同じ外部のリソースを見るように設定するので、DNSサーバーを追加することを要件には含めていません。
zh_tw: CloudStack將DNS設定分為內部及外部。內部DNS用於解析內部主機名稱，例如：NFS伺服器的主機名稱；外部DNS則用於提供客戶虛擬機外網的IP位址解析。您可以為上述兩種類型輸入相同的DNS，但必須確認內部和外網的IP位址都存在到達該DNS伺服器的路由。本手冊描述的環境中，內部資源不只用主機名稱，因此這裡將其設定為和外部DNS一致以簡化安裝流程，不需再為此安裝一台DNS伺服器。

source: Pod Configuration
it_it: Configurazione del Pod
ja_jp: ポッドの設定
zh_tw: 設定pod

source: Now that we've added a Zone, the next step that comes up is a prompt for information regading a pod. Which is looking for 4 items.
it_it: Una volta aggiunta una Zona, il passo successivo è la richiesta di informazioni relative ad un pod. Sono richiesti 4 elementi.
ja_jp: ゾーンを追加したので、次のステップでは、ポッドに関する情報を尋ねられます。それは4つのアイテムで構成されています。
zh_tw: 到這裡，您已新增了一個zone，下一步驟會提示您設定pod的相關資訊

source: Name - We'll use Pod1 for our cloud.
it_it: Name - Si definisce il nome Pod1 per questo cloud.
ja_jp: 名前 - ここでは「Pod1」を使用します。
zh_tw: 名稱 - 這裡以"Pod1"為例

source: Gateway - We'll use <replaceable>172.16.10</replaceable>.1 as our gateway
it_it: Gateway - Si definisce <replaceable>172.16.10</replaceable>.1 come gateway
ja_jp: ゲートウェイ - 「<replaceable>172.16.10</replaceable>.1」をゲートウェイとして使用します。
zh_tw: Gateway - 輸入<replaceable>172.16.10</replaceable>.1

source: Netmask - We'll use 255.255.255.0
it_it: Netmask - Si userà 255.255.255.0
ja_jp: ネットマスク - 「255.255.255.0」を使用します。
zh_tw: Netmask - 輸入255.255.255.0

source: Start/end reserved system IPs - we will use 172.16.10.10-172.16.10.20
it_it: Start/End reserved system IPs - si userà 172.16.10.10-172.16.10.20
ja_jp: システムIPのレンジ - 「172.16.10.10-172.16.10.20」を使用します。
zh_tw: IP範圍 - 輸入172.16.10.10 - 172.16.10.20

source: Guest gateway - We'll use <replaceable>172.16.10</replaceable>.1
it_it: Guest gateway - Si userà <replaceable>172.16.10</replaceable>.1
ja_jp: ゲストのゲートウェイ - 「<replaceable>172.16.10</replaceable>.1」を使用します。
zh_tw: Guest gateway - 使用<replaceable>172.16.10</replaceable>.1

source: Guest netmask - We'll use 255.255.255.0
it_it: Guest netmask - Si userà 255.255.255.0
ja_jp: ゲストのネットマスク - 「255.255.255.0」を使用します。
zh_tw: Guest netmask - 輸入255.255.255.0

source: Guest start/end IP - We'll use <replaceable>172.16.10.</replaceable>30-<replaceable>172.16.10.</replaceable>200
it_it: Guest start/end IP - Si userà <replaceable>172.16.10.</replaceable>30-<replaceable>172.16.10.</replaceable>200
ja_jp: ゲストIPのレンジ - 「 <replaceable>172.16.10.</replaceable>30-<replaceable>172.16.10.</replaceable>200」を使用します。
zh_tw: Guest IP範圍 - 輸入<replaceable>172.16.10.</replaceable>30-<replaceable>172.16.10.</replaceable>200

source: Cluster
ja_jp: クラスター
zh_tw: 設定cluster

source: Now that we've added a Zone, we need only add a few more items for configuring the cluster.
it_it: Ora che si è aggiunta una Zona, occorrono alcuni passi aggiuntivi per configurare il cluster.
ja_jp: ゾーンを追加したので、後はクラスターについての設定をいくつか追加するだけです。
zh_tw: 於新增zone和pod之後，僅需以下資訊設定cluster：

source: Name - We'll use Cluster1
it_it: Name - Si userà Cluster1
ja_jp: 名前 - 「Cluster1」を使用します。
zh_tw: 名稱 - 這裡使用"Cluster1"為例

source: Hypervisor - Choose KVM
it_it: Hypervisor - Selezionare KVM
ja_jp: ハイパーバイザー - 「KVM」を選びます。
zh_tw: Hypervisor - 選擇KVM

source: You should be prompted to add the first host to your cluster at this point. Only a few bits of information are needed.
it_it: Si dovrebbe ricevere a questo punto la richiesta di aggiungere il primo host al cluster. Sono richieste alcune informazioni.
ja_jp: ここではクラスターに最初のホストを追加するように指示されます。必要なのはほんのちょっとの情報だけです。
zh_tw: 此時，系統會提示您為cluster新增第一台主機，您需要輸入以下資訊：

source: Hostname - we'll use the IP address <replaceable>172.16.10.</replaceable>2 since we didn't set up a DNS server.
it_it: Hostname - Poichè si è deciso di non configurare un server DNS interno si userà l'indirizzo IP <replaceable>172.16.10.</replaceable>2
ja_jp: ホスト名 - DNSサーバーを設定してないので、「<replaceable>172.16.10.</replaceable>2」を設定します。
zh_tw: 主機名稱 - 由於沒有設定內部DNS伺服器，這邊我們使用IP位址<replaceable>172.16.10.</replaceable>2

source: Username - we'll use 'root'
it_it: Username - si userà 'root'
ja_jp: ユーザー名 - 'root' を使用します。
zh_tw: 用戶帳號 - root

source: Password - enter the operating system password for the root user
it_it: Password - digitare la password dell'utente root del sistema operativo
ja_jp: パスワード - root ユーザーのOSのパスワードを入力します。
zh_tw: 用戶密碼 - root用戶之密碼

source: Primary Storage
it_it: Storage Primario
ja_jp: プライマリーストレージ
zh_tw: 設定Primary Storage

source: With your cluster now setup - you should be prompted for primary storage information. Choose NFS as the storage type and then enter the following values in the fields:
it_it: Una volta configurato il cluster - verrà visualizzata una richiesta di informazioni per lo storage primario. Scegliere NFS come tipo di storage e poi inserire i seguenti valori:
ja_jp: クラスターが設定できたので、プライマリーストレージの情報が聞かれます。ストレージタイプとして「NFS」を選択し、フィールドに以下の値を入力します：
zh_tw: 根據您目前的cluster設定，系統會提示您輸入primary storage的資訊。Storage type請選擇NFS，並輸入其餘相關資訊

source: Name - We'll use 'Primary1'
it_it: Name - Si userà 'Primary1'
ja_jp: 名前 - 「Primary1」を使用します。
zh_tw: 名稱 - 輸入"Primary1"

source: Server - We'll be using the IP address <replaceable>172.16.10.</replaceable>2
it_it: Server - Si userà qui l'indirizzo IP <replaceable>172.16.10.</replaceable>2
ja_jp: サーバー - 「<replaceable>172.16.10.</replaceable>2」を使用します。
zh_tw: 名稱 - 這裡輸入伺服器的IP位址<replaceable>172.16.10.</replaceable>2

source: Path - Well define /primary as the path we are using
it_it: Path - Si definirà /primary come valore del path utilizzato
ja_jp: パス - 「/primary」を指定します。
zh_tw: Path - 輸入/primary

source: Secondary Storage
it_it: Storage Secondario
ja_jp: セカンダリーストレージ
zh_tw: 設定Secondary Storage

source: If this is a new zone, you'll be prompted for secondary storage information - populate it as follows:
it_it: Se questa è una nuova zona, verrà visualizzata una richiesta di inserire le informazioni dello storage secondatio - digitare come segue:
ja_jp: これが新しいゾーンの場合、セカンダリーストレージの情報を求められます。以下のように入力します：
zh_tw: 如果添加的是一個全新的zone，您需要提供secondary storage的相關資訊

source: NFS server - We'll use the IP address <replaceable>172.16.10.</replaceable>2
it_it: NFS server - Si utilizzerè l'indirizzo IP <replaceable>172.16.10.</replaceable>2
ja_jp: NFSサーバー - 「<replaceable>172.16.10.</replaceable>2」を使用します。
zh_tw: NFS伺服器 - 輸入IP位址<replaceable>172.16.10.</replaceable>2

source: Path - We'll use /secondary
it_it: Path - Si userà /secondary
ja_jp: パス - /secondaryを使用します。
zh_tw: Path - 輸入/secondary

source: Now, click Launch and your cloud should begin setup - it may take several minutes depending on your internet connection speed for setup to finalize.
it_it: Ora, fare click su Launch per avviare la configurazione del cloud - l'operazione impiegherà diversi minuti per completare dipendentemente dalla velocità di connessione ad internet.
ja_jp: 「起動」をクリックすると、クラウドのセットアップが開始されます。インターネット接続の早さによりますが、セットアップが完了するまでには数分かかります。
zh_tw: 現在，點選"啟動"然後您的雲端平台系統將開始逕行設定，設定過程可能會需要幾分鐘的時間，會根據您的實際的網路速度而有所不同
