Repository: 09arnold/cloudstack
Catalog: docs/qig/*/Environment.po
Languages: fr_fr, ja_jp, zh_tw

source: Environment
fr_fr: Environnement
ja_jp: 環境
zh_tw: 環境設定

source: Before you begin, you need to prepare the environment before you install CloudStack. We will go over the steps to prepare now.
fr_fr: Avant de commencer, il est nécessaire de préparer l'environnement pour pouvoir installer CloudStack. Les étapes à suivre sont présentées ci-après.
ja_jp: 始める前に、CloudStackをインストールするための環境を準備する必要があります。ここから準備のためのステップを始めます。
zh_tw: 以下我們將詳細描述安裝Apache CloudStack前的準備工作

source: Operating System
fr_fr: Système d'Exploitation
ja_jp: オペレーティングシステム
zh_tw: 作業系統

source: Using the CentOS 6.3 x86_64 minimal install ISO, you'll need to install CentOS on your hardware. The defaults will generally be acceptable for this installation.
fr_fr: En utilisant l'ISO installation minimal CentOS 6.3 x86_64, installez CentOS sur votre machine physique. Les valeurs par défaut devraient normalement être acceptable pour cette installation.
ja_jp: CentOS 6.3 x86_64の最小インストールISOを使って、マシンにCentOSをインストールしましょう。このインストールでは、ほぼデフォルトの設定で大丈夫です。
zh_tw: 使用CentOS 6.3 x86_64 minimal的安裝ISO檔，於實體主機上安裝CentOS，安裝過程中採用預設選項即可。

source: Once this installation is complete, you'll want to connect to your freshly installed machine via SSH as the root user. Note that you should not allow root logins in a production environment, so be sure to turn off remote logins once you have finished the installation and configuration.
fr_fr: Une fois l'installation terminée, il est utile de pouvoir se connecter en SSH en tant que root à la machine fraichement installée. Il est à noter que l'authentification en tant que root ne devrait pas être autorisée en environnement de production; s'assurer de désactiver l'authentification à distance une fois l'installation et la configuration terminées.
ja_jp: インストールが完了したら、新しくインストールしたマシンにSSH経由で、rootユーザーとして接続したくなるでしょう。注意しないといけないのは、本番環境ではrootログインは許可すべきでないということです。ですので、インストールと設定が済んだ後は、リモートログインをオフにするようにしましょう。
zh_tw: 安裝完成後，您可能會想以root身分採用SSH的方式連接到剛安裝好基礎作業系統的主機。注意，請勿於正式運行的生產環境中，使用root身分登入，也務必於安裝及配置過後關閉SSH遠端登入服務。

source: Configuring the network
fr_fr: Configuration du réseau
ja_jp: ネットワークの設定
zh_tw: 設定網路

source: By default the network will not come up on your hardware and you will need to configure it to work in your environment. Since we specified that there will be no DHCP server in this environment we will be manually configuring your network interface. We will assume, for the purposes of this exercise, that eth0 is the only network interface that will be connected and used.
fr_fr: Par défaut, le réseau ne sera pas disponible sur votre matériel, et il faudra le configurer pour qu'il fonctionne dans l'environnement. Puisqu'il a été spécifié qu'il n'y aura pas de serveur DHCP dans cet environnement, on configurera manuellement l'interface réseau. On supposera, pour les besoins de cet exercice, que eth0 est la seule interface réseau qui sera connectée et utilisée.
ja_jp: デフォルトではネットワークはハードウェアに合った設定になっていないので、作成する環境で動くように設定する必要があります。ここでは、環境内に DHCP サーバーが無いことを前提にしているので、NIC を手動で設定する必要があります。また、これは検証目的ということもあるので、eth0 が唯一かつ使用する NIC であるということを前提とします。
zh_tw: 一般情況下，新安裝的主機尚未啟用網路，您必須根據實際環境進行網路設定。由於網路中不包含DHCP伺服器，您需要手動設定網路介面，為了達到快速安裝的目標，因此，我們假設新安裝的主機上只包含了一張eth0的網路介面。

source: Connecting via the console you should login as root. Check the file <filename>/etc/sysconfig/network-scripts/ifcfg-eth0</filename>, it will look like this by default:
fr_fr: Pour se connecter à la console, s'authentifier en tant que root. Vérifier que le fichier <filename>/etc/sysconfig/network-scripts/ifcfg-eth0</filename>, ressemble par défaut à ceci :
ja_jp: コンソール経由で接続し、root としてログインします。<filename>/etc/sysconfig/network-scripts/ifcfg-eth0</filename>ファイルをチェックします。これはデフォルトではこのようになっているはずです：
zh_tw: 以root身分登入主機，檢查設定檔<filename>/etc/sysconfig/network-scripts/ifcfg-eth0</filename>，預設的情況下，其內容如下所示：

source: Unfortunately, this configuration will not permit you to connect to the network, and is also unsuitable for our purposes with CloudStack. We want to configure that file so that it specifies the IP address, netmask, etc., as shown in the following example:
fr_fr: Malheureusement, cette configuration ne permet pas de se connecter au réseau, ni ne convient aux besoins de Cloudstack. On souhaite configurer ce fichier pour qu'il spécifie l'adresse IP, le masque réseau, etc., comme dans l'exemple suivant:
ja_jp: 残念ながら、この設定はネットワークに接続できる設定になっていませんし、CloudStack で使用するという目的にも適していません。このファイルを編集して、IPアドレスやネットマスクなどを以下の例のように修正したいと思います：
zh_tw: 根據以上的預設設定，您將無法連接到網路，對於CloudStack也同樣不適合;您需修改配置文件，指定IP位址、網路遮罩...等，如下例所示：

source: Hardware Addresses
fr_fr: Adresses Physiques
ja_jp: ハードウェアアドレス
zh_tw: 實體位址

source: You should not use the hardware address (aka MAC address) from our example for your configuration. It is network interface specific, so you should keep the address already provided in the HWADDR directive.
fr_fr: L'adresse physique (adresse MAC) de l'exemple ne doit pas être utilisée pour la configuration. Cette adresse est différente pour chaque interface réseau, donc il faut garder l'adresse disponible dans la directive HWADDR.
ja_jp: ハードウェアアドレス (MACアドレス) はここの例では使用しません。これは NIC に固有の設定なので、HWADDR の項目にすでに入っている値をそのまま使うべきです。
zh_tw: 請勿複製網路配置範例中的MAC位址，每張網路卡具有獨特的MAC位址，保留您實際配置文件中的HWADDR項目中已存在的MAC位址。

source: IP Addressing
fr_fr: Adressage IP
ja_jp: IPアドレス
zh_tw: IP位址

source: Throughout this document we are assuming that you will have a /24 network for your CloudStack implementation. This can be any RFC 1918 network. However, we are assuming that you will match the machine address that we are using. Thus we may use <userinput><replaceable>172.16.10</replaceable>.2</userinput> and because you might be using the 192.168.55.0/24 network you would use <userinput><replaceable>192.168.55</replaceable>.2</userinput>
fr_fr: Tout au long de ce document, on suppose que l'on aura un réseau /24 pour l'implémentation CloudStack. Ceci peut être n'importe quel réseau RFC 1918. Cependant, on suppose que l'adresse machine utilisée sera celle mentionnée ici. Ainsi, on utilise <userinput> <replaceable>172.16.10</replaceable>.2</userinput> et comme le réseau 192.168.55.0/24 pourrait être utilisé, on utiliserait <userinput><replaceable>192.168.55</replaceable>.2</userinput>
ja_jp: このドキュメント全体を通じて、作成しようとしているCloudStackの環境が/24のネットワークを持っていると仮定します。RFC 1918のネットワークであれば何でも構わないのですが、マシンアドレスがここで設定するものとマッチしているとみなして進めます。 ということで、ここでは<userinput><replaceable>172.16.10</replaceable>.2</userinput> を設定しますが、もちろん、192.168.55.0/24 ネットワークを使うのであれば、<userinput><replaceable>192.168.55</replaceable>.2</userinput>を設定しても構いません。
zh_tw: 本文件假設您提供一個Class C之網路供CloudStack使用；該網路可以試任何RFC 1918相容的網路，然而我們假設您使用了IP位址的最後一段與手冊中使用的鄉符合；例如手冊中使用<userinput><replaceable>172.16.10</replaceable>.2</userinput>，如果您使用192.168.55.0/24，請使用<userinput><replaceable>192.168.55</replaceable>.2</userinput>

source: Now that we have the configuration files properly set up, we need to run a few commands to start up the network
fr_fr: Une fois les fichiers de configuration correctement paramétrés, il faut lancer quelques commandes pour démarrer le réseau :
ja_jp: ここまでで、設定ファイルは正しくセットアップできたので、いくつかのコマンドを実行し、ネットワークを開始する必要があります。
zh_tw: 設定檔完成之後，需要執行命令啟動網路

source: Hostname
fr_fr: Nom d'hôte
ja_jp: ホスト名
zh_tw: 主機名稱

source: Cloudstack requires that the hostname be properly set. If you used the default options in the installation, then your hostname is currently set to localhost.localdomain. To test this we will run:
fr_fr: Cloudstack exige que le nom d'hôte soit paramétré correctement. Si les options par défaut ont été utilisées lors de l'installation, alors le nom d'hôte est à présent localhost.localdomain. Pour vérifier ceci, on lancera :
ja_jp: CloudStackではホスト名が正しく設定されている必要があります。もし、インストール時にデフォルトを選択している場合は、ホスト名は localhost.localdomainになっています。これをテストするためにこれを実行します：
zh_tw: CloudStack要求設定正確的主機名稱，如果安裝作業系統時您採用的預設的選項，主機名稱應該為localhost.localdomain，輸入以下命令可以逕行驗證：

source: At this point it will likely return:
fr_fr: À ce point, cela retournera probablement :
ja_jp: ここでは、これが返ってくるはずです：
zh_tw: 此時會回傳：

source: To rectify this situation - we'll set the hostname by editing the <filename>/etc/hosts</filename> file so that it follows a similar format to this example:
fr_fr: Pour rectifier cette situation, on paramétrera le nom d'hôte en éditant le fichier <filename>/etc/hosts</filename> pour que son format ressemble à l'exemple suivant :
ja_jp: この状態を修正するために、<filename>/etc/hosts</filename>ファイルを修正してホスト名を設定します。この例のように修正してください：
zh_tw: 為了讓CloudStack能正確運行，需重新設定主機名稱，編輯<filename>/etc/hosts</filename>文件，更改範例如下：

source: After you've modified that file, go ahead and restart the network using:
fr_fr: Une fois ce fichier modifié, continuer et redémarrer le réseau en utilisant :
ja_jp: ファイルを修正したら、このコマンドでネットワークを再起動します：
zh_tw: 更改設定檔後，重新啟動網路服務：

source: Now recheck with the <command>hostname --fqdn</command> command and ensure that it returns a FQDN response
fr_fr: Puis vérifier à nouveau avec la commande <command>hostname --fqdn</command> et s'assurer qu'elle renvoie une réponse FQDN
ja_jp: ここで、<command>hostname --fqdn</command> コマンドを用いて再チェックし、FQDNが返ってくることを確認します。
zh_tw: 使用<command>hostname --fqdn</command>命令重新檢查主機名稱，請確認此時回傳了一個FQDN的格式結果

source: At the moment, for CloudStack to work properly SELinux must be set to permissive. We want to both configure this for future boots and modify it in the current running system.
fr_fr: À ce point, SELinux doit être paramétré comme permissif pour que CloudStack fonctionne correctement. On souhaite à la fois configurer ceci pour des démarrages futurs et le modifier dans le système en cours de fonctionnement.
ja_jp: CloudStackが正しく動作するために、SELinuxはpermissiveに設定されている必要があります。ここでは今後の起動時の設定と、現在動作しているシステムの設定の両方を変更します。
zh_tw: 目前版本的CloudStack需要設定SELinux為permissive才能正常運行，您需要修改系統設定，並確認設定於主機重新啟動後仍然有效

source: To configure SELinux to be permissive in the running system we need to run the following command:
fr_fr: Pour configurer SELinux en mode permissif dans le système en cours de fonctionnement, lancer la commande suivante :
ja_jp: 動作中のシステムのSELinuxをpermissiveに設定するために、以下のコマンドを実行します：
zh_tw: 將SELinux設定為permissive，需使用以下指令：

source: To ensure that it remains in that state we need to configure the file <filename>/etc/selinux/config</filename> to reflect the permissive state, as shown in this example:
fr_fr: Afin de s'assurer que SELinux reste dans cet état, on doit configurer le fichier <filename>/etc/selinux/config</filename> pour refléter l'état permissif, comme dans l'exemple suivant :
ja_jp: この状態を保つために、<filename>/etc/selinux/config</filename> ファイルを以下に示す例のように設定し、permissiveの状態を反映させます。
zh_tw: 為了確保此設定永久有效，需修改設定檔<filename>/etc/selinux/config</filename>，設定為permissive，如下例所示：

source: NTP configuration is a necessity for keeping all of the clocks in your cloud servers in sync. However, NTP is not installed by default. So we'll install and and configure NTP at this stage. Installation is accomplished as follows:
fr_fr: La configuration de NTP est nécessaire pour que les horloges de tous les serveurs du cloud restent synchronisées. Cependant, NTP n'est pas installé par défaut, donc on l'installera et on le configurera à ce stade.L'installation de NTP se fait comme suit :
ja_jp: NTPの設定は、クラウド内の全てのサーバーの時刻を同期させるために必要です。しかし、NTPはデフォルトではインストールされていません。なので、ここでNTPをインストールして設定します。インストレーションは以下のように行います：
zh_tw: 為了同步雲端平台系統中個主機的時間，需要設定NTP；NTP服務預設是沒有安裝的，因此，必須先安裝NTP後逕行設定，採用以下指令安裝NTP：

source: The actual default configuration is fine for our purposes, so we merely need to enable it and set it to start on boot as follows:
fr_fr: L'actuelle configuration par défaut est convenable pour nos besoins, donc il est surtout nécessaire de l'activer et de faire en sorte qu'elle se charge au démarrage. Ce qui se fait de la façon suivante :
ja_jp: ここでの目的からすると、実際のデフォルトの設定で十分です。なので、単に有効化して起動時に開始するように設定すれば良いです。以下のように：
zh_tw: 使用預設的設定檔即可滿足本文件需求，然後啟用NTP服務並設定為開機後自動執行，如下所示：

source: Configuring the CloudStack Package Repository
fr_fr: Configuration du dépot de paquet CloudStack
ja_jp: CLoudStack パッケージリポジトリの設定
zh_tw: 設定CloudStack的套件庫

source: We need to configure the machine to use a CloudStack package repository.
fr_fr: Nous devons configurer la machine pour qu'elle utilise le dépot de paquet CloudStack.
ja_jp: CloudStack パッケージリポジトリを使うようにマシンを設定します。
zh_tw: 我們必須設定主機使用CloudStack的套件庫

source: The below repository is not an official Apache CloudStack project repository
fr_fr: The dépot suivant n'est pas une source officielle du projet Apache CloudStack, mais est fourni par un membre de la communauté.
ja_jp: 次のリポジトリは Apache CloudStack プロジェクトの公式なリポジトリではありません。
zh_tw: 以下所列的套件庫並非由Apache官方所維護的專案套件庫

source: The Apache CloudStack official releases are source code. As such there are no 'official' binaries available. The full installation guide describes how to take the source release and generate RPMs and and yum repository. This guide attempts to keep things as simple as possible, and thus we are using one of the community-provided yum repositories.
fr_fr: Les releases officiel de Apache CloudStack sont des releases de code source. En tant que telle il n'y a donc pas de fichiers binaires officiels. Le guide d'installation complet décrit comment utiliser le code source et générer des fichiers RPMs à placer dans un dépot yum. Ce guide essaie de faire les choses aussi simplement que possible et nous utilisons donc un dépot fournit par un membre de la communauté aux Pays-Bas.
ja_jp: Apache CloudStack の公式なリリースはソースコードです。ですから、いわゆる「公式な」バイナリはありません。完全なインストールガイドには、ソースコードリリースを取得して、そこから RPM を生成し yum リポジトリを作る方法が記載されています。このガイドでは簡単のため、コミュニティで提供されている yum リポジトリのひとつを使います。
zh_tw: 官方所發佈的Apache CloudStack為其原始程式碼，Apache官方並不提供已編譯完的CloudStack執行程式。完整的安裝指引將會為您描述如何將程式原始碼包裝成RPM檔以及yum的套件庫。此安裝指引相當簡明扼要，因為採用社群提供的yum套件庫，會是一個不錯的選擇

source: To add the CloudStack repository, create <filename>/etc/yum.repos.d/cloudstack.repo</filename> and insert the following information.
fr_fr: Pour ajouter le dépot, créer <filename>/etc/yum.repos.d/cloudstack.repo</filename> et ajoutez les informations suivantes.
ja_jp: CloudStack リポジトリを追加するには、<filename>/etc/yum.repos.d/cloudstack.repo</filename> を作成し、次の内容を書き込みます。
zh_tw: 新增一個CloudStack套件庫，請建立<filename>/etc/yum.repos.d/cloudstack.repo</filename>檔案，並加入以下內容

source: Our configuration is going to use NFS for both primary and secondary storage. We are going to go ahead and setup two NFS shares for those purposes. We'll start out by installing <application>nfs-utils</application>.
fr_fr: Notre configuration va utiliser NFS à la fois pour le stockage primaire et le stockage secondaire. Ainsi, on va configurer deux périphériques NFS. Commencer par installer <application>nfs-utils</application>.
ja_jp: この環境では、NFSをプライマリーとセカンダリーストレージの両方で使用します。この用途のために、2つのNFS共有を設定します。まず、<application>nfs-utils</application>をインストールするところから始めます。
zh_tw: 本文件描述的佈署環境使用NFS做為主要儲存裝置及次要儲存裝置，需要配置兩個NFS的掛載點，在此之前請先安裝<application>nfs-utils</application>

source: We now need to configure NFS to serve up two different shares. This is handled comparatively easily in the <filename>/etc/exports</filename> file. You should ensure that it has the following content:
fr_fr: Il faut à présent configurer NFS pour fonctionner avec deux périphériques différents. Ceci est réalisé assez facilement dans le fichier <filename>/etc/exports</filename>. On doit s'assurer qu'il contient les données suivantes:
ja_jp: 二つの異なる共有を提供するようにNFSを設定します。これは、比較的簡単な <filename>/etc/exports</filename>ファイルによって制御されています。以下のような内容になっていることを確認します：
zh_tw: 接下來需設定NFS提供兩個不同的掛載點，請編輯<filename>/etc/exports</filename>設定檔，並確保其內容如下所示：

source: /secondary *(rw,async,no_root_squash) /primary *(rw,async,no_root_squash)
zh_tw: /primary *(rw,async,no_root_squash) /secondary *(rw,async,no_root_squash)

source: You will note that we specified two directories that don't exist (yet) on the system. We'll go ahead and create those directories and set permissions appropriately on them with the following commands:
fr_fr: Il est à noter que l'on a spécifié deux répertoires qui n'existent pas (encore) sur le système. On va continuer en créant ces répertoires, et en configurant leurs permissions de façon appropriée à l'aide des commandes suivantes :
ja_jp: 気づいたかもしれませんが、ここで定義されている2つのディレクトリは (まだ) システムに存在しません。以下のコマンドで、これらのディレクトリを作成し、パーミッションを正しく設定します：
zh_tw: 您會發現到，上述設定檔中設定了兩個不存在於檔案系統中的目錄，因此，我們必須建立這些目錄並給予正確的權限，指令如下所示：

source: CentOS 6.x releases use NFSv4 by default. NFSv4 requires that domain setting matches on all clients. In our case, the domain is cloud.priv, so ensure that the domain setting in <filename>/etc/idmapd.conf</filename> is uncommented and set as follows:
fr_fr: Les versions CentOS 6.x utilisent NFSv4 par défaut. NFSv4 exige que les configurations de domaines concordent sur tous les clients. Dans le cas présent, le domaine est cloud.priv, donc il faut s'assurer que la configuration du domaine dans <filename>/etc/idmapd.conf</filename> est décommentée et fixée comme suit:
ja_jp: CentOS 6.xリリースではNFSv4をデフォルトで使用します。NFSv4ではドメインの設定が全てのクライアントで一致している必要があります。今回の場合は、ドメインは cloud.priv ですので、<filename>/etc/idmapd.conf</filename>のドメインの設定がアンコメントされており、以下のように設定されていることを確認します。
zh_tw: CentOS 6.x版本預設使用NFSv4，NFSv4要求客戶端的設定相符的域名，本文以cloud.priv為例，請確認文件<filename>/etc/idmapd.conf</filename>中的域名設定沒有被註解，並設定為以下內容：

source: Now you'll need uncomment the configuration values in the file <filename>/etc/sysconfig/nfs</filename>
fr_fr: À présent, décommenter les valeurs de configuration dans le fichier <filename>/etc/sysconfig/nfs</filename>
ja_jp: <filename>/etc/sysconfig/nfs</filename>ファイルの設定値をアンコメントします。
zh_tw: 現在，您必須取消於<filename>/etc/sysconfig/nfs</filename>設定檔中的註解：

source: Now we need to configure the firewall to permit incoming NFS connections. Edit the file <filename>/etc/sysconfig/iptables</filename>
fr_fr: Il faut ensuite configurer le pare-feu pour autoriser les connexions NFS entrantes. Éditer le fichier <filename>/etc/sysconfig/iptables</filename> en y ajoutant les lignes suivantes:
ja_jp: ファイアーウォールを設定し、NFSの受信接続を許可します。 <filename>/etc/sysconfig/iptables</filename>ファイルを編集します。
zh_tw: 接下來，需要設定防火牆，允許NFS連結，編輯設定檔<filename>/etc/sysconfig/iptables</filename>如下：

source: Now you can restart the iptables service with the following command:
fr_fr: On peut maintenant redémarrer le service iptables par la commande suivante:
ja_jp: 以下のコマンドで、iptablesのサービスを再起動させます：
zh_tw: 透過以下指令重新啟動iptables服務：

source: We now need to configure nfs service to start on boot and actually start it on the host by executing the following commands:
fr_fr: Il faut à présent configurer le service nfs pour qu'il se lance au démarrage, et le lancer sur l'hôte en exécutant les commandes suivantes :
ja_jp: NFSサービスを起動時に開始するように設定し、実際に今、以下のコマンドを実行してNFSサービスを開始します。
zh_tw: 設定NSF服務於開機後自動啟用：
