Repository: 09arnold/cloudstack
Catalog: docs/qig/*/Management.po
Languages: fr_fr, it_it, ja_jp, zh_tw

source: Installation of the management server
fr_fr: Installation du serveur de management
it_it: Installazione del management server
ja_jp: 管理サーバーのインストール
zh_tw: 安裝management server

source: Now it is time to start installing CloudStack's management server and some of the related components.
fr_fr: À présent, il est temps de commencer à installer le serveur de management de CloudStack et certains des composants associés.
it_it: Ora è possibile iniziare l'installazione del management server di CloudStack e alcuni componenti.
ja_jp: ここから、CloudStackの管理サーバーといくつかの関連するコンポーネントのインストールを開始します。
zh_tw: 現在需要安裝CloudStack的management server以及相關套件

source: Database Installation and Configuration
fr_fr: Installation et Configuration de la base de données
it_it: Installazione e Configurazione del Database
ja_jp: データベースのインストールと設定
zh_tw: 安裝及設定資料庫

source: We'll start out by installing <application>MySQL</application> and configuring some options to ensure CloudStack runs well.
fr_fr: Commencer par installer <application>MySQL</application> et configurer quelques options pour s'assurer du bon fonctionnement de CloudStack.
it_it: Si comincerà installando <application>MySQL</application> e configurando alcuni parametri per garantire la corretta esecuzione di CloudStack.
ja_jp: まず、 <application>MySQL</application> のインストールから始め、CloudStack が正しく動くようにいくつかのオプションを設定します。
zh_tw: 首先，安裝 <application>MySQL</application>並設定，以確保CloudStack能正常操作資料庫

source: To install <application>MySQL</application> run the following command:
fr_fr: Pour installer <application>MySQL</application>, lancer la commande suivante:
it_it: Per installare <application>MySQL</application> eseguire il seguente comando:
ja_jp: <application>MySQL</application> をインスト−ルするために、以下のコマンドを実行します：
zh_tw: 執行以下指令進行安裝<application>MySQL</application>

source: With <application>MySQL</application> installed we need to make a few configuration changes to <filename>/etc/my.cnf</filename>. Specifically we need to add the following options to the [mysqld] section:
fr_fr: Une fois <application>MySQL</application> installé, il faut procéder à quelques changements de configuration dans <filename>/etc/my.cnf</filename>. Plus particulièrement, on doit ajouter les options suivantes à la section [mysqld]:
it_it: Una volta installato <application>MySQL</application> occorre effettuare alcune modifiche di configurazione nel file <filename>/etc/my.cnf</filename>. In particolare bisogna aggiungere le seguenti opzioni nella sezione [mysqld]:
ja_jp: <application>MySQL</application> のインストールが終了したら、 <filename>/etc/my.cnf</filename>の設定をいくつか変更します。具体的には、[mysqld] セクションに以下の設定を追加する必要があります。
zh_tw: <application>MySQL</application>安裝完成後，需修改<filename>/etc/my.cnf</filename>設定檔，您必須於[mysqld]區塊修改內容如下：

source: Now that <application>MySQL</application> is properly configured we can start it and configure it to start on boot as follows:
fr_fr: Maintenant que <application>MySQL</application> est configuré correctement, on peut le démarrer et le configurer de la façon suivante pour qu'il se lance au démarrage:
it_it: Ora che <application>MySQL</application> è stato configurato correttamente è possibile avviare il servizio e renderlo persistente all'avvio del sistema procedendo come segue:
ja_jp: ここまでで <application>MySQL</application> が正しく設定されたので、開始することができます。また、起動時に MySQL が開始されるように設定します。
zh_tw: <application>MySQL</application>設定完成後，於作業系統中設定為開機後自動執行

source: Installation
it_it: Installazione
ja_jp: インストール
zh_tw: 安裝

source: We are now going to install the management server. We do that by executing the following command:
fr_fr: Nous allons maintenant installer le serveur de management. Pour ce faire nous entrons les commandes suivantes:
it_it: Si procede ora ad installare il management server eseguendo il seguente comando:
ja_jp: マネジメントサーバをインストールします。次のコマンドを実行してください:
zh_tw: 現在我們即將開始安裝CloudStack的management server。我們採用以下指令開始安裝

source: With the application itself installed we can now setup the database, we'll do that with the following command and options:
fr_fr: L'application elle-même étant installée, on peut configurer la base de données en utilisant la commande et les options suivantes:
it_it: Una volta installata l'applicazione è possibile avviare la configurazione del database, procedendo con il seguente comando e relative opzioni:
ja_jp: アプリケーション自体はインストールできたので、データベースをセットアップします。次のコマンドとオプションで実行します：
zh_tw: Management server安裝完後，我們需要初始化資料庫，可以透過以下指令完成：

source: When this process is finished, you should see a message like "CloudStack has successfully initialized the database."
fr_fr: Après la fin de ce processus, un message du style "CloudStack has successfully initialized the database." devrait s'afficher.
it_it: Quando questo processo è completo, viene mostrato un messaggio simile a "CloudStack has successfully initialized the database."
ja_jp: プロセスが終了すると、"CloudStack has successfully initialized the database."というようなメッセージが表示されます。
zh_tw: 當初始化過程完成後，您將會看到類似訊息"CloudStack has successfully initialized the database."

source: Now that the database has been created, we can take the final step in setting up the management server by issuing the following command:
fr_fr: Maintenant que la base de données a été créée, on peut procéder à l'étape finale en configurant le management server, par la commande suivante:
it_it: Una volta creato il database, è possibile effettuare gli ultimi passi per configurare il management server eseguendo il seguente comando:
ja_jp: データベースが作成されたので、管理サーバーのセットアップの最後のステップに入ることができます。以下のコマンドを実行してください：
zh_tw: 資料庫建立後，最後一個步驟是設定management server，請執行以下指令：

source: System Template Setup
fr_fr: Configuration de la Template système
it_it: Configurazione dei Template di sistema
ja_jp: システムテンプレートのセットアップ
zh_tw: 設定系統模板

source: CloudStack uses a number of system VMs to provide functionality for accessing the console of virtual machines, providing various networking services, and managing various aspects of storage. This step will acquire those system images ready for deployment when we bootstrap your cloud.
fr_fr: CloudStack utilise un certain nombre de machines virtuelles système pour permettre l'accès aux consoles des machines virtuelles, fournir divers services réseau, et gérer divers aspects de stockage. Cette étape permet d'acquérir les images système correspondant à ces machines virtuelles système, images prêtes au déploiement lors du bootstrap (amorçage) du cloud à créer.
it_it: CloudStack utilizza diverse VM di sistema per fornire funzionalità di accesso alla console delle virtual machine, per fornire vari servizi di rete, e per la gestione dei vari parametri di gestione dello storage. Il seguente passo consente di acquisire le immagini di questi sistemi e renderle disponibili per distribuirle quando viene poi avviata l'infrastruttura cloud.
ja_jp: CloudStackはいくつものシステムVMを使って、仮想マシンのコンソールへのアクセスや様々なネットワークサービス、ストレージの管理などの機能を提供します。このステップで、これらのシステムイメージを取得して、クラウドを起動する際に展開するための準備を行います。
zh_tw: CloudStack透過一系列的系統虛擬機提供許多的功能，例如：遠端登入虛擬機、提供各式的網路服務、以及管理次存儲中的各種資源。在此步驟中，您將會了解如何取得system VM模板 ，並用於佈署之後的虛擬機

source: Now we need to download the system VM template and deploy that to the share we just mounted. The management server includes a script to properly manipulate the system VMs images.
fr_fr: Il faut à présent télécharger le template de la machine virtuelle système et déployer ce template sur le périphérique monté juste avant. Le serveur de management comprend un script pour manipuler correctement les images des machines virtuelles système.
it_it: Ora bisogna scaricare il template delle VM di sistema nella condivisione appena 'montata'. Il management server contiene uno script in grado di manipolare le immagini delle VM di sistema in modo appropriato.
ja_jp: ここで、システムVMテンプレートをダウンロードし、いまマウントした共有に展開する必要があります。管理サーバーにはシステムVMイメージを正しく操作するためのスクリプトが含まれています。
zh_tw: 接著，需要下載system VM 模板，並將這些模板佈署於剛才建立的secondary storage中；管理伺服器中包含一個腳本可以正確的導入system VM模板 ：

source: That concludes our setup of the management server. We still need to configure CloudStack, but we will do that after we get our hypervisor set up.
fr_fr: Ceci conclut la configuration du serveur de management. Il est encore nécessaire de configurer CloudStack, mais cela sera fait après la configuration de l'hyperviseur.
it_it: Questo conclude le attività di configurazione del management server. Bisogna ancora effettuare altre configurazioni per CloudStack, che verranno eseguite dopo aver configurato le funzioni di hypervisor.
ja_jp: これで管理サーバーのセットアップは終わりです。まだ CloudStack の設定は残っていますが、ハイパーバイザーのセットアップの後で行います。
zh_tw: 以上是management server的安裝及設定過程；我們仍然需要設定CloudStack，但在之前，我們必須啟用hypervisor
