Repository: 09arnold/cloudstack
Catalog: docs/qig/*/Overview.po
Languages: it_it, ja_jp, zh_tw

source: Overview
it_it: Panoramica
ja_jp: 概要
zh_tw: 概述

source: Infrastructure-as-a-Service (IaaS) clouds can be a complex thing to build, and by definition they have a plethora of options, which often lead to confusion for even experienced admins who are newcomers to building cloud platforms. The goal for this runbook is to provide a straightforward set of instructions to get you up and running with CloudStack with a minimum amount of trouble.
it_it: Soluzioni cloud noti come Infrastructure-as-a-Service (IaaS) possono risultare complessi da installare, e per definizione sono disponibili una pletora di opzioni, che spesso portano a confondere anche amministratori di sistema esperto che si avvicinano ai concetti di piattaforme cloud. L'obiettivo di questo runbook è quello di fornire un set di istruzioni chiare per riuscire ad avere una installazione CloudStack in esecuzione in modo semplice.
ja_jp: Infrastructure-as-a-Service (IaaS) のクラウドは、複雑な構築物になり得ます。また、定義上過剰な選択肢があるので、それがまた、経験のある管理者であったとしても、クラウドプラットフォームを構築する初心者には混乱を招きがちです。この runbook の目的は、単純な手順を提供し、CloudStack をできるだけトラブルなく動かせるようにすることです。
zh_tw: 架設基礎設施即服務(Infrastructure-as-a-Service, IaaS)雲端平台服務是一件複雜的工作。在架設的過程中，系統往往提供了過多的選項，以至於即使是經驗豐富的IT人員在架設的初期也會感到十分困惑。本操作手冊的目的是為了提供簡單且直覺的安裝引導，幫助您快速的架設和運行一個簡易的CloudStack環境

source: What exactly are we building?
it_it: Che cosa stiamo per costruire?
ja_jp: 実際私たちは何を構築するのでしょうか？
zh_tw: 架設目標

source: This runbook will focus on building a CloudStack cloud using KVM with CentOS 6.3 with NFS storage on a flat layer-2 network utilizing layer-3 network isolation (aka Security Groups), and doing it all on a single piece of hardware.
it_it: Questo runbook assume che l'installazione del cloud CloudStack sia fatta utilizzando la tecnologia di virtualizzazione KVM con CentOS 6.3 e con storage NFS in una rete flat layer-2 che utilizza l'isolamento di tipo layer-3 (noto anche come Security Group), ed installando il tutto su un singolo sistema hardware.
ja_jp: この runbook では、KVM, CnetOS 6.3, NFS ストレージ, フラットな Layer-2 ネットワーク上で layer-3 ネットワーク隔離（セキュリティグループ）, そしてそれら全てをひとつのマシン上で実行するという構成に焦点を絞っています。
zh_tw: 本操作手冊將重點介紹如何架設CloudStack：使用CentOS 6.3(具備有NFS storage)並以KVM做為Hypervisor，此外採用layer-2以及layer-3的網路做安全分隔（也就是所謂的Security Groups），所有安裝均使用一台實體主機

source: KVM, or Kernel-based Virtual Machine is a virtualization technology for the Linux kernel. KVM supports native virtualization atop processors with hardware virtualization extensions.
it_it: KVM, o Kernel-based Virtual Machine è una tecnologia di virtualizzazione presente nel kernel Linux. KVM supporta nativamente la virtualizzazione al di sopra dei processori che includono estensioni di virtualizzazione.
ja_jp: KVM（Kernel-based Virtual Machine）はLinuxカーネルの仮想化技術です。KVMは、ハードウェア仮想化機能を持つプロセッサー上で動作し、ネイティブの仮想化をサポートします。
zh_tw: KVM（KVM, or Kernel-based Virtual Machine）是一種針對Linux核心的虛擬化技術。KVM支持本地虛擬化，但主機必須具有支持硬體虛擬化的延伸。

source: Security Groups act as distributed firewalls that control access to a group of virtual machines.
it_it: I Security Group sono funzioni simili a firewall distribuiti che controllano l'accesso ad un gruppo di virtual machine.
ja_jp: セキュリティグループは分散されたファイアーウォールとして動き、仮想マシンのグループへのアクセスをコントロールします。
zh_tw: Security Groups類似於分散式防火牆的功能，它可以控制一組虛擬機的存取權限

source: High level overview of the process
it_it: Panoramica generale del processo
ja_jp: プロセスのハイレベルの概要
zh_tw: 流程概述

source: Before we actually get to installing CloudStack, we'll start with installing our base operating system, and then configuring that to act as an NFS server for several types of storage. We'll install the management server, download the systemVMs, and finally install the agent software. Finally we'll spend a good deal of time configuring the entire cloud in the CloudStack web interface.
it_it: Prima di procedere con l'installazione di CloudStack, si effettua l'installazione del sistema operativo di base, e poi si configura il sistema per offrire servizi server NFS per vari tipi di storage. Si procederà poi con l'installazione di un management server, con il download delle VM di sistema, e infine con l'installazione del software agent. Al termine si procederà in maniera corposa con la configurazione dell'intera infrastruttura cloud utilizzando l'interfaccia web di CloudStack.
ja_jp: CloudStackのインストールを実際に始める前に、ベースとなるオペレーティングシステムのインストールから始めます。そして、それをいくつかのタイプのストレージとして使う NFS サーバーとして構成します。管理サーバーをインストールして、システム VM をダウンロードして、最後にエージェントソフトウェアをインストールします。そこまでできたら、クラウド全体を設定するために、CloudStack のウェブインターフェースで多くの時間を過ごすことになります。
zh_tw: 在實際安裝CloudStack之前，需要先安裝作業系統，並將其設定為一台NFS伺服器；接下來是安裝management server並下載系統虛擬機模版，以及安裝agent；最後將描述如何使用CloudStack的Web介面設定整個雲端平台服務。

source: Prerequisites
it_it: Prerequisiti
ja_jp: 要件
zh_tw: 事前準備

source: To complete this runbook you'll need the following items:
it_it: Per completare questo runbook occorre disporre di:
ja_jp: この runbook を完了するために、次のものが必要です：
zh_tw: 完成本操作手冊所描述的所有操作流程，您可能需要下列資源：

source: At least one computer which supports hardware virtualization.
it_it: Almeno un sistema che supporta la virtualizzazione hardware.
ja_jp: 少なくとも1台のハードウェア仮想化をサポートするコンピューター
zh_tw: 至少一台支援硬體虛擬化的主機

source: The <ulink url="http://mirrors.kernel.org/centos/6.3/isos/x86_64/CentOS-6.3-x86_64-minimal.iso"> CentOS 6.3 x86_64 minimal install CD </ulink>
it_it: Il <ulink url="http://mirrors.kernel.org/centos/6.3/isos/x86_64/CentOS-6.3-x86_64-minimal.iso"> CD di installazione minimal di CentOS 6.3 x86_64 </ulink>
ja_jp: <ulink url="http://mirrors.kernel.org/centos/6.3/isos/x86_64/CentOS-6.3-x86_64-minimal.iso"> CentOS 6.3 x86_64 最小インストール CD </ulink>
zh_tw: CentOS 6.3安裝ISO檔<ulink url="http://mirrors.kernel.org/centos/6.3/isos/x86_64/CentOS-6.3-x86_64-minimal.iso"> CentOS 6.3 x86_64 minimal install CD </ulink>

source: A /24 network with the gateway being at xxx.xxx.xxx.1, no DHCP should be on this network and none of the computers running CloudStack will have a dynamic address. Again this is done for the sake of simplicity.
it_it: Una rete /24 con gateway assegnato all'indirizzo xxx.xxx.xxx.1, senza la presenza di servizi DHCP server e in cui nessuno dei sistemi dell'installazione CloudStack deve avere indirizzo di tipo dinamico. Si ricorda che questa impostazione è per consentire la semplificazione dell'infrastruttura.
ja_jp: xxx.xxx.xxx.1 で始まるゲートウェイを持つ /24 ネットワークで、DHCP が存在せず、かつ、CloudStack を実行しているコンピュータでは動的アドレスを使っていないこと。念のために言うと、簡単ためこの条件にしています。
zh_tw: 一段class C的網路，gateway為xxx.xxx.xxx.1，此網段中不能具有DHCP，所有的CloudStack主機必須使用靜態的IP位址，再次強調，這是為了簡化安裝。
